hysonglet/platformio_synwit/misc/svd/SWM320.svd
        <register>
          <name>PLLDIV</name>
          <description>PLLDIV register</description>
          <addressOffset>0x031028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>FBDIV field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIV</name>
              <description>ADDIV field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVCO</name>
              <description>ADVCO field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>INDIV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>OUTDIV field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLSET</name>
          <description>PLLSET register</description>
          <addressOffset>0x03102C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPFBW</name>
              <description>LPFBW field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIASADJ</name>
              <description>BIASADJ field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFVSEL</name>
              <description>REFVSEL field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPADJL</name>
              <description>CHPADJL field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPADJM</name>
              <description>CHPADJM field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLLOCK</name>
          <description>PLLLOCK register</description>
          <addressOffset>0x031030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BODIE</name>
          <description>BODIE register</description>
          <addressOffset>0x031034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_2V2</name>
              <description>_2V2 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODIF</name>
          <description>BODIF register</description>
          <addressOffset>0x031038</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_2V2</name>
              <description>_2V2 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORT</name>
      <description>Registers group</description>
      <groupName>PORT</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000664</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PORTA_SEL</name>
          <description>PORTA_SEL register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTB_SEL</name>
          <description>PORTB_SEL register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTC_SEL</name>
          <description>PORTC_SEL register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTM_SEL0</name>
          <description>PORTM_SEL0 register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTM_SEL1</name>
          <description>PORTM_SEL1 register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTN_SEL0</name>
          <description>PORTN_SEL0 register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTN_SEL1</name>
          <description>PORTN_SEL1 register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTP_SEL0</name>
          <description>PORTP_SEL0 register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTP_SEL1</name>
          <description>PORTP_SEL1 register</description>
          <addressOffset>0x000044</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTA_MUX0</name>
          <description>PORTA_MUX0 register</description>
          <addressOffset>0x000100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTA_MUX1</name>
          <description>PORTA_MUX1 register</description>
          <addressOffset>0x000104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTB_MUX0</name>
          <description>PORTB_MUX0 register</description>
          <addressOffset>0x000110</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTB_MUX1</name>
          <description>PORTB_MUX1 register</description>
          <addressOffset>0x000114</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTC_MUX0</name>
          <description>PORTC_MUX0 register</description>
          <addressOffset>0x000120</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTC_MUX1</name>
          <description>PORTC_MUX1 register</description>
          <addressOffset>0x000124</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTM_MUX0</name>
          <description>PORTM_MUX0 register</description>
          <addressOffset>0x000160</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTM_MUX1</name>
          <description>PORTM_MUX1 register</description>
          <addressOffset>0x000164</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTM_MUX2</name>
          <description>PORTM_MUX2 register</description>
          <addressOffset>0x000168</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTM_MUX3</name>
          <description>PORTM_MUX3 register</description>
          <addressOffset>0x00016C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTN_MUX0</name>
          <description>PORTN_MUX0 register</description>
          <addressOffset>0x000170</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTN_MUX1</name>
          <description>PORTN_MUX1 register</description>
          <addressOffset>0x000174</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTN_MUX2</name>
          <description>PORTN_MUX2 register</description>
          <addressOffset>0x000178</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTP_MUX0</name>
          <description>PORTP_MUX0 register</description>
          <addressOffset>0x000180</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTP_MUX1</name>
          <description>PORTP_MUX1 register</description>
          <addressOffset>0x000184</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTP_MUX2</name>
          <description>PORTP_MUX2 register</description>
          <addressOffset>0x000188</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTP_MUX3</name>
          <description>PORTP_MUX3 register</description>
          <addressOffset>0x00018C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTA_PULLU</name>
          <description>PORTA_PULLU register</description>
          <addressOffset>0x000200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN0</name>
              <description>PIN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>PIN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>PIN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>PIN3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>PIN4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>PIN5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>PIN6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>PIN7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN8</name>
              <description>PIN8 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN9</name>
              <description>PIN9 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN10</name>
              <description>PIN10 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN11</name>
              <description>PIN11 field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN12</name>
              <description>PIN12 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>PIN13 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>PIN14 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>PIN15 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC_PULLU</name>
          <description>PORTC_PULLU register</description>
          <addressOffset>0x000210</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN0</name>
              <description>PIN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>PIN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>PIN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>PIN3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>PIN4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>PIN5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>PIN6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>PIN7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN8</name>
              <description>PIN8 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN9</name>
              <description>PIN9 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN10</name>
              <description>PIN10 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN11</name>
              <description>PIN11 field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN12</name>
              <description>PIN12 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>PIN13 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>PIN14 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>PIN15 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
