hysonglet/platformio_synwit/misc/svd/SWM320.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40012000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x40013000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOM</name>
      <baseAddress>0x40015000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPION</name>
      <baseAddress>0x40016000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOP</name>
      <baseAddress>0x40018000</baseAddress>
    </peripheral>
    <peripheral>
      <name>TIMR0</name>
      <description>Registers group</description>
      <groupName>TIMR</groupName>
      <baseAddress>0x40017000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LDVAL</name>
          <description>LDVAL register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CVAL</name>
          <description>CVAL register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>CTRL</name>
          <description>CTRL register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLKSRC field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE</name>
              <description>CASCADE field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR1</name>
      <baseAddress>0x4001700C</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR2</name>
      <baseAddress>0x40017018</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR3</name>
      <baseAddress>0x40017024</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR4</name>
      <baseAddress>0x40017030</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR5</name>
      <baseAddress>0x4001703C</baseAddress>
    </peripheral>
    <peripheral>
      <name>TIMRG</name>
      <description>Registers group</description>
      <groupName>TIMRG</groupName>
      <baseAddress>0x40017060</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCTRL</name>
          <description>PCTRL register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGH</name>
              <description>HIGH field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLKSRC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCVAL</name>
          <description>PCVAL register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMR0</name>
              <description>TIMR0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR1</name>
              <description>TIMR1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR2</name>
              <description>TIMR2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR3</name>
              <description>TIMR3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR4</name>
              <description>TIMR4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR5</name>
              <description>TIMR5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PULSE</name>
              <description>PULSE field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMR0</name>
              <description>TIMR0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR1</name>
              <description>TIMR1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR2</name>
              <description>TIMR2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR3</name>
              <description>TIMR3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR4</name>
              <description>TIMR4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR5</name>
              <description>TIMR5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PULSE</name>
              <description>PULSE field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HALT</name>
          <description>HALT register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMR0</name>
              <description>TIMR0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR1</name>
              <description>TIMR1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR2</name>
              <description>TIMR2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR3</name>
              <description>TIMR3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR4</name>
              <description>TIMR4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR5</name>
              <description>TIMR5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
