hysonglet/platformio_synwit/misc/svd/SWM320.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Registers group</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EN</name>
          <description>EN register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>CH0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>CH2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>CH3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <description>CH4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <description>CH5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <description>CH6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7</name>
              <description>CH7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>IM register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>CH0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>CH2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>CH3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <description>CH4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <description>CH5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <description>CH6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7</name>
              <description>CH7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>CH0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>CH2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>CH3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <description>CH4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <description>CH5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <description>CH6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7</name>
              <description>CH7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CH0</name>
          <description>register cluster</description>
          <addressOffset>0x000040</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST</name>
                <description>BURST field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGLEN</name>
            <description>SRCSGLEN register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGLEN</name>
            <description>DSTSGLEN register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH1</name>
          <description>register cluster</description>
          <addressOffset>0x000080</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST</name>
                <description>BURST field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGLEN</name>
            <description>SRCSGLEN register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGLEN</name>
            <description>DSTSGLEN register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>CH2</name>
          <description>register cluster</description>
          <addressOffset>0x0000C0</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST</name>
                <description>BURST field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGLEN</name>
            <description>SRCSGLEN register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGLEN</name>
            <description>DSTSGLEN register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
